dannyf00/Another-Arduino-Clone/pic24duino.c
//interrupt service routine
void _ISR_PSV _T5Interrupt(void) {
	IFS1bits.T5IF=0;							//clear tmr1 interrupt flag
	_tmr5_isrptr();								//execute user tmr1 isr
}

//initialize the timer5 (16bit)
void tmr5Init(uint8_t ps, uint16_t period) {
	_tmr5_isrptr=empty_handler;					//point to default handler

	PMD1bits.T5MD = 0;							//enable power to tmr
	T5CONbits.TON = 0;							//turn off rtc1
	T5CONbits.TCS = 0;							//use internal clock = Fosc
	//T5CONbits.T32 = 0;						//0->16 bit timer, 1->32bit timer
	T5CONbits.TCKPS=ps & TMR_PSMASK;			//set prescaler to 1:1
	T5CONbits.TGATE = 0;						//rtc1 gate disabled
	TMR5 = 0;									//reset the timer/counter
	PR5=period-1;								//minimum rtc resolution is 1ms
	IFS1bits.T5IF = 0;							//reset the flag
	IEC1bits.T5IE = 0;							//rtc1 interrupt off
	T5CONbits.TON = 1;							//turn on rtc1
}

//activate the isr handler
void tmr5AttachISR(void (*isrptr)(void)) {
	_tmr5_isrptr=isrptr;						//activate the isr handler
	//IPC5bits.T5IP = TMR_IPDEFAULT;
	//IPC5bits.T5IS = TMR_ISDEFAULT;
	IFS1bits.T5IF = 0;							//reset the flag
	IEC1bits.T5IE = 1;							//rtc1 interrupt on
}
//end Timer

//define pwm functions
//time base is Timer2, defined in mcu_init()

//pwm1/oc1
//reset pwm
void pwm1Init(void) {
	//power up the pwm module
	PMD2bits.OC1MD = 0;						//0->turn on the peripheral, 1->turn off the peripheral

	//assign the output pins
	PWM12RP();

    //tris pin presumed to have been set to output

#if 	defined(__PIC24FJ64GA102__) | defined (__PIC24FJ64GA104__) | \
		defined(__PIC24FJ32GA102__) | defined (__PIC24FJ32GA104__)

	//OCxCON1 register settings
	//reset the registers
	OC1CON1 = 0x0000;
	OC1CON2 = 0x0000;
    OC1CON1bits.OCM = 7;					//0b110 -> edge aligned pwm, 0b111->center aligned pwm
    OC1CON1bits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
    OC1R = OC1RS = 0;						//reset the duty cycle registers
    //OC1CON1bits.ON= 1;					//1->turn on oc, 0->turn off oc
#else
	//for GA002 chips
	//OCxCON1 register settings
	//reset the registers
	OC1CON = 0x0000;
	//OC1CON2 = 0x0000;
    OC1CONbits.OCM = 0x06;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled
    OC1CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
    OC1R = OC1RS = 0;						//reset the duty cycle registers
    //OC1CON1bits.ON= 1;					//1->turn on oc, 0->turn off oc
#endif	
}

//pwm2/oc2
//reset pwm
void pwm2Init(void) {
	//power up the pwm module
	PMD2bits.OC2MD = 0;						//0->turn on the peripheral, 1->turn off the peripheral

	//assign the output pins
	PWM22RP();

    //tris pin presumed to have been set to output

#if 	defined(__PIC24FJ64GA102__) | defined (__PIC24FJ64GA104__) | \
		defined(__PIC24FJ32GA102__) | defined (__PIC24FJ32GA104__)
	//OCxCON1 register settings
	//reset the registers
	OC2CON1 = 0x0000;
	OC2CON2 = 0x0000;
    OC2CON1bits.OCM = 7;					//0b110 -> edge aligned pwm, 0b111->center aligned pwm
    OC2CON1bits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
    OC2R = OC2RS = 0;						//reset the duty cycle registers
    //OC2CON1bits.ON= 1;						//1->turn on oc, 0->turn off oc
#else
	//for ga002 devices
	//OCxCON1 register settings
	//reset the registers
	OC2CON = 0x0000;
	//OC2CON2 = 0x0000;
    OC2CONbits.OCM = 0x06;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled
    OC2CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
    OC2R = OC2RS = 0;						//reset the duty cycle registers
    //OC2CON1bits.ON= 1;						//1->turn on oc, 0->turn off oc
#endif
}


//pwm3/oc3
//reset pwm
void pwm3Init(void) {
	//power up the pwm module
	PMD2bits.OC3MD = 0;						//0->turn on the peripheral, 1->turn off the peripheral

	//assign the output pins
	PWM32RP();

    //tris pin presumed to have been set to output

#if 	defined(__PIC24FJ64GA102__) | defined (__PIC24FJ64GA104__) | \
		defined(__PIC24FJ32GA102__) | defined (__PIC24FJ32GA104__)
	//OCxCON1 register settings
	//reset the registers
	OC3CON1 = 0x0000;
	OC3CON2 = 0x0000;
    OC3CON1bits.OCM = 7;					//0b110 -> edge aligned pwm, 0b111->center aligned pwm
    OC3CON1bits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
    OC3R = OC3RS = 0;						//reset the duty cycle registers
    //OC2CON1bits.ON= 1;						//1->turn on oc, 0->turn off oc
#else
	//for ga002 devices
	//OCxCON1 register settings
	//reset the registers
	OC3CON = 0x0000;
	//OC3CON2 = 0x0000;
    OC3CONbits.OCM = 0x06;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled
    OC3CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
    OC3R = OC3RS = 0;						//reset the duty cycle registers
    //OC3CON1bits.ON= 1;						//1->turn on oc, 0->turn off oc
#endif
}


//pwm4/oc4
//reset pwm
void pwm4Init(void) {
	//power up the pwm module
	PMD2bits.OC4MD = 0;						//0->turn on the peripheral, 1->turn off the peripheral

	//assign the output pins
	PWM42RP();

    //tris pin presumed to have been set to output

#if 	defined(__PIC24FJ64GA102__) | defined (__PIC24FJ64GA104__) | \
		defined(__PIC24FJ32GA102__) | defined (__PIC24FJ32GA104__)
	//OCxCON1 register settings
	//reset the registers
	OC4CON1 = 0x0000;
	OC4CON2 = 0x0000;
    OC4CON1bits.OCM = 7;					//0b110 -> edge aligned pwm, 0b111->center aligned pwm
    OC4CON1bits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
    OC4R = OC4RS = 0;						//reset the duty cycle registers
    //OC2CON1bits.ON= 1;						//1->turn on oc, 0->turn off oc
#else
	//for ga002 devices
	//OCxCON1 register settings
	//reset the registers
	OC4CON = 0x0000;
	//OC4CON2 = 0x0000;
    OC4CONbits.OCM = 0x06;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled
    OC4CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
    OC4R = OC4RS = 0;						//reset the duty cycle registers
    //OC4CON1bits.ON= 1;						//1->turn on oc, 0->turn off oc
#endif
}


