dannyf00/Another-Arduino-Clone/pic24duino.c
//pwm5/oc5
//reset pwm
void pwm5Init(void) {
	//power up the pwm module
	PMD2bits.OC5MD = 0;						//0->turn on the peripheral, 1->turn off the peripheral

	//assign the output pins
	PWM52RP();

    //tris pin presumed to have been set to output

#if 	defined(__PIC24FJ64GA102__) | defined (__PIC24FJ64GA104__) | \
		defined(__PIC24FJ32GA102__) | defined (__PIC24FJ32GA104__)
	//OCxCON1 register settings
	//reset the registers
	OC5CON1 = 0x0000;
	OC5CON2 = 0x0000;
    OC5CON1bits.OCM = 7;					//0b110 -> edge aligned pwm, 0b111->center aligned pwm
    OC5CON1bits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
    OC5R = OC5RS = 0;						//reset the duty cycle registers
    //OC5CON1bits.ON= 1;						//1->turn on oc, 0->turn off oc
#else
	//for ga002 devices
	//OCxCON1 register settings
	//reset the registers
	OC5CON = 0x0000;
	//OC5CON2 = 0x0000;
    OC5CONbits.OCM = 0x06;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled
    OC5CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
    OC5R = OC5RS = 0;						//reset the duty cycle registers
    //OC5CON1bits.ON= 1;						//1->turn on oc, 0->turn off oc
#endif
}

//end pwm/oc

//adc module
//rest the adc
//automatic sampling (ASAM=1), manual conversion
void adcInit(void) {
	PMD1bits.ADC1MD = 0;						//enable power to adc
	
	//reset the adc control registers
	AD1CON1 = 0;
	AD1CON2 = 0;
	AD1CON3 = 0;
	
	AD1CON1bits.SSRC = 7;					//0->samp ends sampling and starts conversion. 7=auto mode
	AD1CON2bits.VCFG = 0;					//0..7. adc reference: 0->AVdd-AVss,1=Vref+-AVss, 2=AVdd-Vref-, 3=Vref+ - Vref-
	AD1CON2bits.ALTS = 0;					//0->always use mux A inputs. 1->alternate between mux a and mux b inputs
	AD1CON3bits.SAMC = 31;					//0..31. 0->0 Tad (not recommended), 1->1 Tad, ... 31->32 Tad
	AD1CON3bits.ADCS = 2;					//0..63. 0->Tcy, 1-> 1Tcy, 63->64 Tcy
	AD1CSSL = 0;							//scanning disabled
	AD1PCFGbits.PCFG15=1;					//1->band gap enabled, 0->band gap disabled
	AD1CON1bits.ADON = 1;					//1->enable adc
}

//read the adc
//single ended only. 
uint16_t analogRead(uint16_t adc_ch) {
	uint16_t tmp;
	
	tmp=AD1PCFG;							//save current port configuration setting
	//set up adc port configuration bits
	//for the positive channel (mux a only)
	AD1CON1bits.DONE=0;
	adc_ch = adc_ch & 0x0f;					//adc_ch limited to 16 channels
#if 1
	AD1PCFG &=~(1<<adc_ch);					//configure the port to be analog
	AD1CHS = adc_ch;						//select the channel
#else
	switch (adc_ch) {
		case ADC_AN0:		AD1PCFG &=~(1<< 0); AD1CHS =0x0000; break;		//AD1PCFG: 1->digital GPIO, 0->analog input
		case ADC_AN1:		AD1PCFG &=~(1<< 1); AD1CHS =0x0001; break;
		case ADC_AN2:		AD1PCFG &=~(1<< 2); AD1CHS =0x0002; break;
		case ADC_AN3:		AD1PCFG &=~(1<< 3); AD1CHS =0x0003; break;
		case ADC_AN4:		AD1PCFG &=~(1<< 4); AD1CHS =0x0004; break;
		case ADC_AN5:		AD1PCFG &=~(1<< 5); AD1CHS =0x0005; break;
		case ADC_AN6:		AD1PCFG &=~(1<< 6); AD1CHS =0x0006; break;					//not implemented on 28pin devices. do not use
		case ADC_AN7:		AD1PCFG &=~(1<< 7); AD1CHS =0x0007; break;					//not implemented on 28pin devices. do not use
		case ADC_AN8:		AD1PCFG &=~(1<< 8); AD1CHS =0x0008; break;					//not implemented on 28pin devices. do not use
		case ADC_AN9:		AD1PCFG &=~(1<< 9); AD1CHS =0x0008; break;
		case ADC_AN10:		AD1PCFG &=~(1<<10); AD1CHS =0x000a; break;
		case ADC_AN11:		AD1PCFG &=~(1<<11); AD1CHS =0x000b; break;
		case ADC_AN12:		AD1PCFG &=~(1<<12); AD1CHS =0x000c; break;						//not impelemned on 28pin devices. do not use
		case ADC_VCORE:		AD1PCFG &=~(1<<13); AD1CHS =0x000d; break;
		case ADC_VBG_2:		AD1PCFG &=~(1<<14); AD1CHS =0x000e; break;
		case ADC_VBG:		AD1PCFG &=~(1<<15); AD1CHS =0x000f; break;						//AD1PCFG = ~adc_ch;					//mux b: not used; mux a: negative is Vref-,
		//case ADC_CTMU:		AD1PCFG &=~(0<<0); AD1CHS = 0x001f; break;						//reserved for ctmu
		default: 			break;				//do nothing
	}
#endif
	AD1CON1bits.SAMP = 1;						//start the adc
	while (!AD1CON1bits.DONE) continue;			//wait for adc to finish
	AD1PCFG = tmp;								//restore ad1pcfg setting
	return ADC1BUF0;							//return the adc results
}
//end ADC

//input capture
static void (*_ic1_isrptr)(void)=empty_handler;				//function pointer pointing to empty_handler by default
volatile uint16_t IC1DAT=0;						//buffer 

//input capture ISR
void _ISR_PSV _IC1Interrupt(void) {				//for PIC32
	//clear the flag
	IC1DAT = IC1BUF;							//read the captured value
	IFS0bits.IC1IF = 0;							//clear the flag after the buffer has been read (the interrupt flag is persistent)
	_ic1_isrptr();								//run user handler
}

//reset input capture 1
//16-bit mode, rising edge, single capture, Timer2 as timebase
//interrupt disabled
void ic1Init(void) {
	_ic1_isrptr = empty_handler;				//reset user handler

	IC12RP();									//assign pin to IC
	PMD2bits.IC1MD = 0;							//0->enable power to input capture

#if 	defined(__PIC24FJ64GA102__) | defined (__PIC24FJ64GA104__) | \
		defined(__PIC24FJ32GA102__) | defined (__PIC24FJ32GA104__)
	IC1CON1 = 0;						//reset to default value
	IC1CON2 = 0;						//reset to default value
	IC1CON1  = 	(0<<15) |				//1->enable the module, 0->disable the module
                (0<<13) |				//0->operates in idle, 1->don't operate in idle
                (1<<9) |				//1-.capture rising edge first (only used for ICM110)
                (0<<8) |				//1->32-bit mode, 0->16-bit mode
                (1<<7) |				//1->timer2 as timebase, 0->timer3 as timebase
                (0<<5) |				//0->interrupt on every capture event, 1->on every second capture event, 2->on every 3rd event, 3->on every 4th event
                (0<<4) |				//0->ICx no overflow, 1->ICx overflow
                (0<<3) |				//0->buffer is empty, 1->buffer is not empty
                (3<<0) |				//0->ICx disabled, 1->every edge, 2->every falling edge, 3->every rising edge, ...
                0x00;

